# MetallicpaintPearlColorByObject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MetallicPaint..::..MetallicpaintPearlColorByObject Property
MetallicPaint Class See Also
---
The property labeled "Color By Object" from the "MetallicPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetallicpaintPearlColorByObject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetallicpaintPearlColorByObject As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetallicpaintPearlColorByObject {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace